app/views/showings/index.html.erb

              <% @showings.each do |showing| %>
                <% showing.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."showing_id" = $1  [["showing_id", 1]]