app/views/movies/index.html.erb

SELECT "showings".* FROM "showings" WHERE "showings"."movie_id" = $1  [["movie_id", 1]]
---
              <% end %>
              <% movie.showings.each do |showing| %>