app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "orders".* FROM "orders" INNER JOIN "showings" ON "orders"."showing_id" = "showings"."id" WHERE "showings"."movie_id" = $1  [["movie_id", 1]]
SELECT "showings".* FROM "showings" WHERE "showings"."movie_id" = $1  [["movie_id", 1]]
---
  def show
    @movie = Movie.find(params[:id])
    @showings = @movie.showings
    @orders = @movie.orders

INSERT INTO "movies" ("title") VALUES ($1) RETURNING "id"  [["title", "Zootopia"]]
---
  def create
    @movie = Movie.create(movie_params)