app/controllers/orders_controller.rb

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @showing = Showing.find(params[:showing_id])
    @order = Order.find(params[:id])

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @order = Order.new
    @showing = Showing.find(params[:showing_id])

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("name", "email", "credit_card", "card_expy_date", "showing_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Carrie Smith"], ["email", "carrie@yahoo.com"], ["credit_card", "0000000000000000"], ["card_expy_date", "2017-01-01"], ["showing_id", 1]]
---
  def create
    @showing = Showing.find(params[:showing_id])
    @order = @showing.orders.create(order_params)