app/controllers/sessions_controller.rb

  def create
    @admin_user = AdminUser.find_by(username: params[:admin_user][:username])
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."username" = $1 LIMIT 1  [["username", "sashafierce"]]