app/controllers/showings_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = $1 LIMIT 1  [["title", "Room"]]
---
  def create
    auditorium = Auditorium.find_by(name: params[:showing][:auditorium])
    movie = Movie.find_by(title: params[:showing][:movie])