app/controllers/showings_controller.rb

SELECT "showings".* FROM "showings"
---
  def index
    @showings = Showing.all

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @showing = Showing.find(params[:id])

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @showing = Showing.find(params[:id])

INSERT INTO "showings" ("date", "time", "movie_id", "auditorium_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2016-05-01"], ["time", "2000-01-01 17:00:00.000000"], ["movie_id", 1], ["auditorium_id", 2]]
---
  def create
    @showing = Showing.create(showing_params)

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = $1 LIMIT 1  [["title", "Room"]]
---
  def update
    @showing = Showing.find(params[:id])
    movie = Movie.find_by(title: params[:movie])